	"""
  函数名	参数	作用
	1	print()		打印显示，三个引号可以换行。
	2	sort()		排序,在原列上
	3	sorted()		重新生成一列
	4	raw_input()		获得输入值，里面可以用引号提示内容
	5	input()		以python可运行的方式获得输入
	6	def :		声称函数
	7	%r		替换内部的字符串，显示原始
	8	%d		替换内部的数字
	9	%s		替换内部的字符串
	10	/n		换行
	11	/t		tab
	12	/r		换行
	13	argv，script		获得输入值，script是文件名；*argv是获得所有输入值
	14	return		获得返回值
	15	open()	r	默认以读的方式打开后取得值并关闭
	16		w	写入
	17		+	同时打开
	18	close()		保存并关闭
	19	#		表示注释
	20	class()		定义类
	21	for		循环
	22	while		while循环
	23	if		循环
	24	函数的操作是从内到外		
	25	点的操作是从左往右		
	26	/		除号应用在2里对于int是不保留小数后的，但是如果是float，用4.，就可以了
未想到	27	aaa.read()		读aaa文件的每一行
未想到	28	aaa.seek(0)		回到列表的第一行
	29	len()		返回一个列表内的字符长度
	30	list		生成一个列表
	31	dic		生成一个字典
	32	tuple		生成一个元组
未想到	33	write()		把文件中的内容写入，可以用aaa.write(indate)，表示把indate写入aaa的文件中。
	34			
"""
